# Лабораторная работа 6_3
# Табулирование с циклом for
# Программист: Машталеров Я.О., группа 643
# Принял: асс. Соколов Е.А., доц. Дмитриева Т.А.
# Дата: 08.10.2026
# Вариант 13
# Переменные: 
# x0 - точка старта, h - шаг, n - точка финиша
# p - произведение, s - сумма

from math import *

def f(x):
    match x:
        case _ if -3 <= x <= 3:
            return 1+sqrt(9-x**2)
        case _ if 3 < x <= 7:
            return 1+sqrt(4-(x-5)**2)
        case _ if 7 < x <= 9:
            return 1+sqrt(1-(x-8)**2)
        case _:
            return 1

x0 = int(input("Введите точку старта: "))
h = int(input("Введите шаг: "))
n = int(input("Введите точку финиша: "))
p = 1
s = 0

for x in range(x0, n+1, h):
    y = f(x)
    p = p*y
    s = s + y

print("P = %.2f, S = %.2f" % (p, s))