# Программа lab_5_alt
# Разработка разветвляющихся алгоритмов и программ
# Вывод значения кратной приставки метрической системы
# Програмист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 01.10.26
# Переменные:
#   k - код приставки (входные данные)

print('Введите код приставки:')
print('1 - дека  1E+1')
print('2 - гекто 1E+2')
print('3 - кило  1E+3')
print('6 - мега  1E+6')
print('9 - гига  1E+9')

k = input('Код = ')

match k:
    case "1":
        print('Дека - множитель 1E+1 =', 10**1)
    case "2":
        print('Гекто - множитель 1E+2 =', 10**2)
    case "3":
        print('Кило - множитель 1E+3 =', 10**3)
    case "6":
        print('Мега - множитель 1E+6 =', 10**6)
    case "9":
        print('Гига - множитель 1E+9 =', 10**9)
    case _:
        print('Ошибка: приставки с кодом', k, 'нет')