# Программа lab_11_1
# Кортежи
# Программист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 19.10.26
# Переменные:
#   n - количество чисел в наборе
#   k - кортеж чисел набора
#   p - число, которое проверяется на равенство произведению двух чисел набора
#   i1, i2 - номера двух разных элементов кортежа
#   flag - признак того, что подходящая пара найдена

n = int(input())
k = tuple(int(input("Введите число")) for i in range(n))
p = int(input())


flag = False
for i1 in range(n):
    for i2 in range(i1, n):
        if k[i1] * k[i2] == p:
            flag = True


if flag:
    print('ДА')
else:
    print('НЕТ')