# Программа lab_11_2
# Кортежи
# Программист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 19.10.26
# Переменные:
#   k - исходный кортеж
#   n - искомый элемент
#   i - номер элемента кортежа
#   cnt - сколько раз элемент n уже встретился
#   na, ko - номера первого и второго появления элемента n

k = tuple(map(int, input().split()))
n = int(input())

cnt = 0
na, ko = 0, len(k) - 1
for i in range(len(k)):
    if k[i] == n:
        cnt += 1
        if cnt == 1:
            na = i
        else:
            ko = i
            break

if cnt:
    print(k[na:ko + 1])
else:
    print(())
