# Программа lab_8
# Сосатвление и использование функций пользователя 
# Вычисление выражений 
# Програмист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 17.09.26
# Переменные: 
#   x0, xn, hx - начальное, конечное значение аргумента и шаг
#   k, n - параметры циклов
#   x, Y - аргумент и значение функции
#   S - сумма
#   a - произвольная переменная

from math import *
print('Введите x0(hx)xn')
x0 = float(input())
hx = float(input())
xn = float(input())

a = float(input('Введите a='))

x = x0
while x <= xn + hx/4:
    S = 0
    if x < 0.5:
        for n in range(50 +1):
            p = 1
            for _ in range(2):
                p *= 2 * n + 1
            S += 1/p
    else:
        for k in range(10+1):
            S += log(x) * sin(k*(x-a))
    Y = S
    print(f'{x = }, {Y = }') 
    x += hx