# Программа lab_9
# Списки, одномерные массивы
# Программист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 19.10.26
# Переменные:
#   k - исходный массив, список вещественных чисел
#   p, ot - число положительных и число отрицательных элементов
#   new - новый массив из элементов одного знака, число которых больше
#   i - элемент массива

k = list(map(float, input().split()))

p, ot = 0, 0
for i in k:
    if i > 0:
        p += 1
    if i < 0:
        ot += 1

new = []
if p > ot:
    for i in k:
        if i > 0:
            new.append(i)
else:
    for i in k:
        if i < 0:
            new.append(i)
print(new)
