# Лабораторная работа 7_2
# Цикл с предусловием
# Программист: Машталеров Я.О., группа 643
# Принял: асс. Соколов Е.А., доц. Дмитриева Т.А.
# Дата: 24.10.2026
# Вариант 13
# Переменные: 
# x0 - точка старта, h - шаг, xn - точка финиша
# a - расстояние, k - число точек

from math import *

def f(x):
    return x**2 + 2*x + 2

x0 = int(input("Введите точку старта: "))
h = int(input("Введите шаг: "))
xn = int(input("Введите точку финиша: "))
a = int(input("Введите расстояние: "))

x = 0
k = 0
while x < xn + h/3: 
    y = f(x)
    if sqrt((x-(-2/(2*2)))**2 + (y-f(-2/(2*2)))**2) >= a:
        k += 1
    x += h

print(k)