# Программа lab_7_2
# Проектирование алгоритмов и программ с использованием цикла с предусловием
# Програмист: Косяков Д.А., гр.6413
# Проверил: Щенева Ю.Б.
# Дата написания: 08.10.26
# Переменные:
#   y - функция
#   x, x0, xn, hx - аргумет и параметры его изменения
#   S - площадь области

from math import cos

x0 = float(input('Введите x0='))
xn = float(input('Введите xn='))
hx = float(input('Введите hx='))

x = x0
S = 0
while x <= xn + hx/ 3:
    y = x/2 * cos(3*x)
    S += y
    x += hx

print(f'S= {S}')