# Программа lab_4_2
# Разработка разветвляющихся алгоритмов и программ
# Програмист: Косяков Д. А., гр.6413
# Проверил: Щенева Ю. Б.
# Дата написания: 17.09.26
# Переменные: 
#   x, y, z, a ,r - входные данные 
#   p - полупериметр треугольника
#   St, Ss, Sс - площадь треугольника, квадрата и круга соответственно

from math import *

x = float(input(' Введите x= '))
y = float(input(' Введите y= '))
z = float(input(' Введите z= '))
a = float(input(' Введите a= '))
r = float(input(' Введите r= '))

print('x=',x,'y=',y,'z=',z,'a=',a,'r=',r)

p = (x + y + z) / 2
St = sqrt(p * (p - x) * (p - y) * (p - z))
Ss = a**2
Sc = pi * r**2

if St > Ss and St > Sc:
    print(' Максимальная площадь у треугольника = ', St)
elif Ss > St and Ss > Sc:
    print(' Максимальная площадь у квадрата = ', Ss)
else:
    print(' Максимальная площадь у круга = ', Sc)
